Plan for **development** is ready.
**Branch/Commit:** refs/heads/development / 56f890d6cab0d17a351ac3d43af9d1b0643c7066
**Run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/19556034225

**Plan (last ~500 lines):**
```
              + "ec2:DescribeInstances",
              + "ec2:DescribeInternetGateways",
              + "ec2:DescribeSecurityGroups",
              + "ec2:DescribeSubnets",
              + "ec2:DescribeTags",
              + "ec2:DescribeVpcs",
              + "ec2:GetCoipPoolUsage",
              + "elasticloadbalancing:DescribeListenerAttributes",
              + "elasticloadbalancing:DescribeListenerCertificates",
              + "elasticloadbalancing:DescribeListeners",
              + "elasticloadbalancing:DescribeLoadBalancerAttributes",
              + "elasticloadbalancing:DescribeLoadBalancers",
              + "elasticloadbalancing:DescribeRules",
              + "elasticloadbalancing:DescribeSSLPolicies",
              + "elasticloadbalancing:DescribeTags",
              + "elasticloadbalancing:DescribeTargetGroupAttributes",
              + "elasticloadbalancing:DescribeTargetGroups",
              + "elasticloadbalancing:DescribeTargetHealth",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "acm:DescribeCertificate",
              + "acm:ListCertificates",
              + "cognito-idp:DescribeUserPoolClient",
              + "iam:GetServerCertificate",
              + "iam:ListServerCertificates",
              + "shield:CreateProtection",
              + "shield:DeleteProtection",
              + "shield:DescribeProtection",
              + "shield:DescribeSubscription",
              + "shield:GetSubscriptionState",
              + "shield:ListProtections",
              + "waf-regional:AssociateWebACL",
              + "waf-regional:DisassociateWebACL",
              + "waf-regional:GetWebACL",
              + "waf-regional:GetWebACLForResource",
              + "wafv2:AssociateWebACL",
              + "wafv2:DisassociateWebACL",
              + "wafv2:GetWebACL",
              + "wafv2:GetWebACLForResource",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:AuthorizeSecurityGroupEgress",
              + "ec2:AuthorizeSecurityGroupIngress",
              + "ec2:CreateSecurityGroup",
              + "ec2:CreateTags",
              + "ec2:DeleteSecurityGroup",
              + "ec2:DeleteTags",
              + "ec2:RevokeSecurityGroupEgress",
              + "ec2:RevokeSecurityGroupIngress",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "elasticloadbalancing:CreateListener",
              + "elasticloadbalancing:CreateLoadBalancer",
              + "elasticloadbalancing:CreateRule",
              + "elasticloadbalancing:CreateTargetGroup",
              + "elasticloadbalancing:DeleteListener",
              + "elasticloadbalancing:DeleteLoadBalancer",
              + "elasticloadbalancing:DeleteRule",
              + "elasticloadbalancing:DeleteTargetGroup",
              + "elasticloadbalancing:DeregisterTargets",
              + "elasticloadbalancing:RegisterTargets",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "elasticloadbalancing:AddTags",
              + "elasticloadbalancing:RemoveTags",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "elasticloadbalancing:AddListenerCertificates",
              + "elasticloadbalancing:ModifyListener",
              + "elasticloadbalancing:ModifyLoadBalancerAttributes",
              + "elasticloadbalancing:ModifyRule",
              + "elasticloadbalancing:ModifyTargetGroup",
              + "elasticloadbalancing:ModifyTargetGroupAttributes",
              + "elasticloadbalancing:RemoveListenerCertificates",
              + "elasticloadbalancing:SetIpAddressType",
              + "elasticloadbalancing:SetSecurityGroups",
              + "elasticloadbalancing:SetSubnets",
              + "elasticloadbalancing:SetWebAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:CreateServiceLinkedRole",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "elasticloadbalancing.amazonaws.com",
                ]
              + variable = "iam:AWSServiceName"
            }
        }
    }

  # module.helm.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.helm.data.aws_subnets.public will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_subnets" "public" {
      + id   = (known after apply)
      + ids  = (known after apply)
      + tags = (known after apply)

      + filter {
          + name   = "tag:kubernetes.io/cluster/platform-dev"
          + values = [
              + "shared",
            ]
        }
      + filter {
          + name   = "tag:kubernetes.io/role/elb"
          + values = [
              + "1",
            ]
        }
      + filter {
          + name   = "vpc-id"
          + values = [
              + "vpc-0282bdadda98058f7",
            ]
        }
    }

  # module.helm.aws_iam_policy.external_dns_policy["this"] will be updated in-place
  ~ resource "aws_iam_policy" "external_dns_policy" {
        id               = "arn:aws:iam::107363237542:policy/eks/platform-dev/platform-dev-external-dns"
        name             = "platform-dev-external-dns"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "route53:ChangeResourceRecordSets"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:route53:::hostedzone/*"
                    },
                  - {
                      - Action   = [
                          - "route53:ListTagsForResource",
                          - "route53:ListResourceRecordSets",
                          - "route53:ListHostedZones",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
        }
        # (7 unchanged attributes hidden)
    }

  # module.helm.aws_iam_policy.load_balancer_controller_policy["this"] will be updated in-place
  ~ resource "aws_iam_policy" "load_balancer_controller_policy" {
        id               = "arn:aws:iam::107363237542:policy/eks/platform-dev/platform-dev-lbc"
        name             = "platform-dev-lbc"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "elasticloadbalancing:DescribeTargetHealth",
                          - "elasticloadbalancing:DescribeTargetGroups",
                          - "elasticloadbalancing:DescribeTargetGroupAttributes",
                          - "elasticloadbalancing:DescribeTags",
                          - "elasticloadbalancing:DescribeSSLPolicies",
                          - "elasticloadbalancing:DescribeRules",
                          - "elasticloadbalancing:DescribeLoadBalancers",
                          - "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          - "elasticloadbalancing:DescribeListeners",
                          - "elasticloadbalancing:DescribeListenerCertificates",
                          - "elasticloadbalancing:DescribeListenerAttributes",
                          - "ec2:GetCoipPoolUsage",
                          - "ec2:DescribeVpcs",
                          - "ec2:DescribeTags",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeSecurityGroups",
                          - "ec2:DescribeInternetGateways",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeCoipPools",
                          - "ec2:DescribeAvailabilityZones",
                          - "ec2:DescribeAddresses",
                          - "ec2:DescribeAccountAttributes",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "wafv2:GetWebACLForResource",
                          - "wafv2:GetWebACL",
                          - "wafv2:DisassociateWebACL",
                          - "wafv2:AssociateWebACL",
                          - "waf-regional:GetWebACLForResource",
                          - "waf-regional:GetWebACL",
                          - "waf-regional:DisassociateWebACL",
                          - "waf-regional:AssociateWebACL",
                          - "shield:ListProtections",
                          - "shield:GetSubscriptionState",
                          - "shield:DescribeSubscription",
                          - "shield:DescribeProtection",
                          - "shield:DeleteProtection",
                          - "shield:CreateProtection",
                          - "iam:ListServerCertificates",
                          - "iam:GetServerCertificate",
                          - "cognito-idp:DescribeUserPoolClient",
                          - "acm:ListCertificates",
                          - "acm:DescribeCertificate",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ec2:RevokeSecurityGroupIngress",
                          - "ec2:RevokeSecurityGroupEgress",
                          - "ec2:DeleteTags",
                          - "ec2:DeleteSecurityGroup",
                          - "ec2:CreateTags",
                          - "ec2:CreateSecurityGroup",
                          - "ec2:AuthorizeSecurityGroupIngress",
                          - "ec2:AuthorizeSecurityGroupEgress",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:RegisterTargets",
                          - "elasticloadbalancing:DeregisterTargets",
                          - "elasticloadbalancing:DeleteTargetGroup",
                          - "elasticloadbalancing:DeleteRule",
                          - "elasticloadbalancing:DeleteLoadBalancer",
                          - "elasticloadbalancing:DeleteListener",
                          - "elasticloadbalancing:CreateTargetGroup",
                          - "elasticloadbalancing:CreateRule",
                          - "elasticloadbalancing:CreateLoadBalancer",
                          - "elasticloadbalancing:CreateListener",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:RemoveTags",
                          - "elasticloadbalancing:AddTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:SetWebAcl",
                          - "elasticloadbalancing:SetSubnets",
                          - "elasticloadbalancing:SetSecurityGroups",
                          - "elasticloadbalancing:SetIpAddressType",
                          - "elasticloadbalancing:RemoveListenerCertificates",
                          - "elasticloadbalancing:ModifyTargetGroupAttributes",
                          - "elasticloadbalancing:ModifyTargetGroup",
                          - "elasticloadbalancing:ModifyRule",
                          - "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          - "elasticloadbalancing:ModifyListener",
                          - "elasticloadbalancing:AddListenerCertificates",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = "iam:CreateServiceLinkedRole"
                      - Condition = {
                          - StringEquals = {
                              - "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
        }
        # (7 unchanged attributes hidden)
    }

  # module.helm.aws_iam_role.eks_ebs_csi_controller["this"] will be updated in-place
  ~ resource "aws_iam_role" "eks_ebs_csi_controller" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/0B5A96A9751D03154A9EAEBB4D5584D5:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/0B5A96A9751D03154A9EAEBB4D5584D5:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::107363237542:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/0B5A96A9751D03154A9EAEBB4D5584D5"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "platform-dev-ebs-csi"
        name                  = "platform-dev-ebs-csi"
        tags                  = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
        }
        # (11 unchanged attributes hidden)
    }

  # module.helm.aws_iam_role.eks_external_dns["this"] will be updated in-place
  ~ resource "aws_iam_role" "eks_external_dns" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/0B5A96A9751D03154A9EAEBB4D5584D5:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/0B5A96A9751D03154A9EAEBB4D5584D5:sub" = "system:serviceaccount:kube-system:external-dns"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::107363237542:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/0B5A96A9751D03154A9EAEBB4D5584D5"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "platform-dev-external-dns"
        name                  = "platform-dev-external-dns"
        tags                  = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
        }
        # (11 unchanged attributes hidden)
    }

  # module.helm.aws_iam_role.eks_load_balancer_controller["this"] will be updated in-place
  ~ resource "aws_iam_role" "eks_load_balancer_controller" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.us-east-1.amazonaws.com/id/0B5A96A9751D03154A9EAEBB4D5584D5:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-east-1.amazonaws.com/id/0B5A96A9751D03154A9EAEBB4D5584D5:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::107363237542:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/0B5A96A9751D03154A9EAEBB4D5584D5"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "platform-dev-lbc"
        name                  = "platform-dev-lbc"
        tags                  = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Owner"       = "platform-team"
            "Project"     = "platform"
        }
        # (11 unchanged attributes hidden)
    }

  # module.helm.helm_release.aws_load_balancer_controller["this"] will be updated in-place
  ~ resource "helm_release" "aws_load_balancer_controller" {
        id                         = "aws-load-balancer-controller"
      ~ metadata                   = [
          - {
              - app_version    = "v2.15.0"
              - chart          = "aws-load-balancer-controller"
              - first_deployed = 1763677719
              - last_deployed  = 1763677719
              - name           = "aws-load-balancer-controller"
              - namespace      = "kube-system"
              - notes          = <<-EOT
                    AWS Load Balancer controller installed!
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - clusterName    = "platform-dev"
                      - region         = "us-east-1"
                      - serviceAccount = {
                          - annotations = {
                              - "eks.amazonaws.com/role-arn" = "arn:aws:iam::107363237542:role/eks/platform-dev/platform-dev-lbc"
                            }
                          - create      = false
                          - name        = "aws-load-balancer-controller"
                        }
                      - vpcId          = "vpc-0282bdadda98058f7"
                    }
                )
              - version        = "1.15.0"
            },
        ] -> (known after apply)
        name                       = "aws-load-balancer-controller"
        # (26 unchanged attributes hidden)

      - set {
          - name  = "region" -> null
          - value = "us-east-1" -> null
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "region"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.network.helm_release.cilium will be updated in-place
  ~ resource "helm_release" "cilium" {
      ~ force_update               = false -> true
        id                         = "cilium"
        name                       = "cilium"
        # (27 unchanged attributes hidden)

        # (27 unchanged blocks hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.
```
